x=1
while x<10:
    print(x)
    x+=1  #x<10的數都抓出來直到10
print("-------------------------------------------------")

for c in "12345asdasd6":  #""內的數都抓出來
    print(c)
print("-------------------------------------------------")
for b in [7,8,9]:   #[]內的數字都抓出來
    print(b)
print("-------------------------------------------------")
for d in range(5): #範圍5內的數字都抓出來 直到到5為止
    print(d)


#For 迴圈和 while 迴圈同樣都是重複執行某一段程式碼。
# for 迴圈是針對一個「序列」(sequence) 裡每一個項目逐一進行處理
# while 迴圈則是每次迭代都會針對某種# 「條件」(condition) 下判斷，重複執行到不符那個該條件為止。

